# running in formal/test/src/
read -formal uart_tx.v
# ... other files should go here
prep -top uart_tx

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
